Repository: parfentsevandrey-blip/test
Catalog: VeilVPN/Veil/Resources/Localizable.xcstrings
Source language: en
Languages: fa, ru, uk, zh_hans

source: Behind a bridge these exclusions apply to the exit only: tor checks the list against the bridges themselves, and a bridge in an excluded country is refused — with every bridge refused there would be nothing left to connect through. The bridge is the hop you chose by hand in any case.
fa: پشت یک پل، این استثناها فقط بر خروجی اعمال می‌شوند: tor فهرست را با خودِ پل‌ها می‌سنجد و پلی که در کشوری کنارگذاشته باشد رد می‌شود — و وقتی همهٔ پل‌ها رد شوند، چیزی برای اتصال نمی‌ماند. پل در هر حال همان گامی است که خودتان دستی انتخاب کرده‌اید.
ru: За мостом эти исключения действуют только на выход: tor сверяет список с самими мостами, и мост в исключённой стране отвергается — а когда отвергнуты все мосты, подключаться становится не через что. Мост в любом случае тот узел, который вы выбрали вручную.
uk: За мостом ці винятки діють лише на вихід: tor звіряє список із самими мостами, і міст у виключеній країні відхиляється — а коли відхилено всі мости, підключатися стає нічим. Міст у будь-якому разі є вузлом, який ви обрали вручну.
zh_hans: 在网桥之后，这些排除仅作用于出口：tor 会用该列表比对网桥本身，位于被排除国家的网桥会被拒绝——当所有网桥都被拒绝时，就没有任何可用于连接的通道了。况且网桥本就是你亲手选定的那一跳。

source: Block plain HTTP through Tor
fa: مسدود کردن HTTP ساده از طریق Tor
ru: Блокировать обычный HTTP через Tor
uk: Блокувати звичайний HTTP через Tor
zh_hans: 阻止通过 Tor 的明文 HTTP

source: Blocked
fa: مسدود
ru: Заблокировано
uk: Заблоковано
zh_hans: 已阻断

source: Bootstrapping
fa: راه‌اندازی اولیه
ru: Начальная загрузка
uk: Початкове завантаження
zh_hans: 引导中

source: Bridge
fa: پل
ru: Мост
uk: Міст
zh_hans: 网桥

source: Bridge lines
fa: خطوط پل
ru: Строки мостов
uk: Рядки мостів
zh_hans: 网桥行

source: Bridge lines are stored in plain text
fa: خطوط پل به‌صورت متن ساده ذخیره می‌شوند
ru: Строки мостов хранятся открытым текстом
uk: Рядки мостів зберігаються відкритим текстом
zh_hans: 网桥行以明文存储

source: Bridge service
fa: سرویس پل
ru: Служба мостов
uk: Служба мостів
zh_hans: 网桥服务

source: Bridges
fa: پل‌ها
ru: Мосты
uk: Мости
zh_hans: 网桥

source: Bridges, routes, sites, padding and every other preference in one JSON file.
fa: پل‌ها، مسیرها، سایت‌ها، پوشش ترافیک و همهٔ تنظیمات دیگر در یک فایل JSON.
ru: Мосты, маршруты, сайты, маскировка и все остальные настройки в одном JSON-файле.
uk: Мости, маршрути, сайти, маскування та всі інші налаштування в одному JSON-файлі.
zh_hans: 网桥、路由、站点、流量填充及其他所有偏好设置，保存在一个 JSON 文件中。

source: Building a circuit…
fa: در حال ساخت مدار…
ru: Построение цепочки…
uk: Побудова ланцюжка…
zh_hans: 正在建立链路…

source: Building circuits
fa: در حال ساخت مدارها
ru: Построение цепочек
uk: Побудова ланцюжків
zh_hans: 正在建立链路

source: Built-in obfs4 bridges from Tor Browser. Fast, but the addresses are public and may already be blocked.
fa: پل‌های obfs4 داخلی از Tor Browser. سریع است، اما آدرس‌ها عمومی‌اند و شاید از قبل مسدود شده باشند.
ru: Встроенные мосты obfs4 из Tor Browser. Быстро, но адреса публичны и могут быть уже заблокированы.
uk: Вбудовані мости obfs4 із Tor Browser. Швидко, але адреси публічні й можуть бути вже заблоковані.
zh_hans: 来自 Tor Browser 的内置 obfs4 网桥。速度快，但地址是公开的，可能已被封锁。

source: Cancel
fa: لغو
ru: Отмена
uk: Скасувати
zh_hans: 取消

source: Change the transport in Settings → Bridges
fa: تغییر روش انتقال در تنظیمات ← پل‌ها
ru: Сменить транспорт: Настройки → Мосты
uk: Змінити транспорт: Налаштування → Мости
zh_hans: 在“设置 → 网桥”中更改传输方式

source: Changes take effect on the next connection.
fa: تغییرات در اتصال بعدی اعمال می‌شود.
ru: Изменения вступят в силу при следующем подключении.
uk: Зміни набудуть чинності під час наступного підключення.
zh_hans: 更改将在下次连接时生效。

source: Check
fa: بررسی
ru: Проверка
uk: Перевірка
zh_hans: 检查

source: Check Tor
fa: بررسی Tor
ru: Проверить Tor
uk: Перевірити Tor
zh_hans: 检查 Tor

source: Check Tor Connection
fa: بررسی اتصال Tor
ru: Проверить подключение к Tor
uk: Перевірити підключення до Tor
zh_hans: 检查 Tor 连接

source: Check again
fa: بررسی دوباره
ru: Проверить снова
uk: Перевірити знову
zh_hans: 重新检查

source: Check direct reachability
fa: بررسی دسترسی مستقیم
ru: Проверить прямую доступность
uk: Перевірити пряму доступність
zh_hans: 检查直连可达性

source: Check for Updates…
fa: بررسی به‌روزرسانی‌ها…
ru: Проверить обновления…
uk: Перевірити оновлення…
zh_hans: 检查更新…

source: Check for updates automatically
fa: بررسی خودکار به‌روزرسانی‌ها
ru: Проверять обновления автоматически
uk: Перевіряти оновлення автоматично
zh_hans: 自动检查更新

source: Check for updates only after connecting
fa: بررسی به‌روزرسانی فقط پس از اتصال
ru: Проверять обновления только после подключения
uk: Перевіряти оновлення лише після підключення
zh_hans: 仅在连接后检查更新

source: Check now
fa: اکنون بررسی کن
ru: Проверить сейчас
uk: Перевірити зараз
zh_hans: 立即检查

source: Check the exit
fa: بررسی گره خروجی
ru: Проверить выход
uk: Перевірити вихід
zh_hans: 检查出口

source: Checking the Internet…
fa: در حال بررسی اینترنت…
ru: Проверка интернета…
uk: Перевірка інтернету…
zh_hans: 正在检查互联网…

source: Checking youtube.com…
fa: در حال بررسی youtube.com…
ru: Проверка youtube.com…
uk: Перевірка youtube.com…
zh_hans: 正在检查 youtube.com…

source: Checking…
fa: در حال بررسی…
ru: Проверка…
uk: Перевірка…
zh_hans: 检查中…

source: Checks whether Tor is reachable directly, then tries the last transport that worked, your custom bridges, Snowflake, obfs4 and meek in turn until one bootstraps.
fa: ابتدا بررسی می‌کند Tor مستقیم در دسترس هست یا نه، سپس به‌ترتیب آخرین روش انتقالی که کار کرده، پل‌های شما، Snowflake، obfs4 و meek را امتحان می‌کند تا یکی راه بیفتد.
ru: Проверяет, доступен ли Tor напрямую, затем по очереди пробует последний сработавший транспорт, ваши мосты, Snowflake, obfs4 и meek, пока один не подключится.
uk: Перевіряє, чи доступний Tor напряму, а потім по черзі пробує останній робочий транспорт, ваші мости, Snowflake, obfs4 і meek, доки один не підключиться.
zh_hans: 先检查能否直连 Tor，然后依次尝试上次成功的传输方式、你的自定义网桥、Snowflake、obfs4 和 meek，直到有一个引导成功。

source: Choose on the Route screen
fa: انتخاب در صفحهٔ مسیر
ru: Выбрать на экране «Маршрут»
uk: Обрати на екрані «Маршрут»
zh_hans: 在“路由”页面选择

source: Choose the exit country
fa: انتخاب کشور گرهٔ خروجی
ru: Выбрать страну выходного узла
uk: Вибрати країну вихідного вузла
zh_hans: 选择出口国家/地区

source: Choosing a wide exit for video…
fa: در حال انتخاب خروجی پهن برای ویدیو…
ru: Выбираем широкий выход для видео…
uk: Обираємо широкий вихід для відео…
zh_hans: 正在为视频选择宽带出口…

source: Chosen by Tor when the circuit is built.
fa: هنگام ساخت مدار توسط Tor انتخاب می‌شود.
ru: Выбирается Tor при построении цепочки.
uk: Вибирається Tor під час побудови ланцюжка.
zh_hans: 由 Tor 在构建链路时选择。

source: Circuit per site
fa: مدار برای هر سایت
ru: Цепочка на сайт
uk: Ланцюжок на сайт
zh_hans: 每站点独立链路

source: Circuits kept open
fa: مدارهای باز نگه‌داشته‌شده
ru: Цепочек держать открытыми
uk: Ланцюжків тримати відкритими
zh_hans: 保持打开的链路数

source: Clear
fa: پاک کردن
ru: Очистить
uk: Очистити
zh_hans: 清除

source: Click to change in Settings → YouTube.
fa: برای تغییر در تنظیمات ← YouTube کلیک کنید.
ru: Клик — изменить в Настройках → YouTube.
uk: Клік — змінити в Налаштуваннях → YouTube.
zh_hans: 点击在“设置 → YouTube”中更改。

source: Click to change the transport in Settings → Bridges.
fa: برای تغییر انتقال در تنظیمات ← پل‌ها کلیک کنید.
ru: Клик — сменить транспорт в Настройках → Мосты.
uk: Клік — змінити транспорт у Налаштуваннях → Мости.
zh_hans: 点击在“设置 → 网桥”中更改传输方式。

source: Click to check the Internet.
fa: برای بررسی اینترنت کلیک کنید.
ru: Клик — проверить интернет.
uk: Клік — перевірити інтернет.
zh_hans: 点击检查互联网。

source: Click to choose countries on the Route screen.
fa: برای انتخاب کشورها در صفحهٔ مسیر کلیک کنید.
ru: Клик — выбрать страны на экране «Маршрут».
uk: Клік — вибрати країни на екрані «Маршрут».
zh_hans: 点击在“路由”界面选择国家/地区。

source: Click to connect through Tor
fa: برای اتصال از طریق Tor کلیک کنید
ru: Нажмите, чтобы подключиться через Tor
uk: Натисніть, щоб підключитися через Tor
zh_hans: 点按以通过 Tor 连接

source: Click to open Settings.
fa: برای باز کردن تنظیمات کلیک کنید.
ru: Клик — открыть Настройки.
uk: Клік — відкрити Налаштування.
zh_hans: 点击打开设置。

source: Click to test youtube.com through Veil
fa: برای آزمایش youtube.com از طریق Veil کلیک کنید
ru: Клик — проверить youtube.com через Veil
uk: Клік — перевірити youtube.com через Veil
zh_hans: 点击通过 Veil 测试 youtube.com

source: Click to verify the exit with check.torproject.org
fa: برای بررسی خروجی با check.torproject.org کلیک کنید
ru: Клик — проверить выход через check.torproject.org
uk: Клік — перевірити вихід через check.torproject.org
zh_hans: 点击通过 check.torproject.org 验证出口

source: Click to verify the exit.
fa: برای بررسی خروجی کلیک کنید.
ru: Клик — проверить выход.
uk: Клік — перевірити вихід.
zh_hans: 点击验证出口。

source: Conflux: send on the lowest-latency path
fa: Conflux: ارسال از مسیر با کمترین تأخیر
ru: Conflux: отправлять по пути с наименьшей задержкой
uk: Conflux: надсилати шляхом із найменшою затримкою
zh_hans: Conflux：沿延迟最低的路径发送

source: Connect
fa: اتصال
ru: Подключить
uk: Підключити
zh_hans: 连接

source: Connect at launch
fa: اتصال هنگام اجرا
ru: Подключаться при запуске
uk: Підключатися під час запуску
zh_hans: 启动时连接

source: Connect first
fa: ابتدا متصل شوید
ru: Сначала подключитесь
uk: Спершу підключіться
zh_hans: 请先连接

source: Connect first: the hardened window goes through Veil’s proxy.
fa: ابتدا متصل شوید: پنجرهٔ سخت‌شده از پراکسی Veil می‌گذرد.
ru: Сначала подключитесь: защищённое окно ходит через прокси Veil.
uk: Спершу підключіться: захищене вікно ходить через проксі Veil.
zh_hans: 请先连接：强化窗口经由 Veil 的代理。

source: Connect through Tor (⌘K)
fa: اتصال از طریق Tor (⌘K)
ru: Подключиться через Tor (⌘K)
uk: Підключитися через Tor (⌘K)
zh_hans: 通过 Tor 连接 (⌘K)

source: Connect to Tor or enable YouTube Turbo first — the check goes through Veil’s proxy exactly like Safari would.
fa: ابتدا به Tor وصل شوید یا YouTube Turbo را فعال کنید — بررسی دقیقاً مثل Safari از پراکسی Veil عبور می‌کند.
ru: Сначала подключитесь к Tor или включите YouTube Turbo — проверка идёт через прокси Veil точно так же, как Safari.
uk: Спочатку підключіться до Tor або ввімкніть YouTube Turbo — перевірка йде через проксі Veil так само, як Safari.
zh_hans: 请先连接 Tor 或启用 YouTube Turbo——检查会像 Safari 一样通过 Veil 的代理进行。

source: Connect to public Tor relays without any bridge. Fastest, but it only works where Tor is not blocked.
fa: اتصال به رله‌های عمومی Tor بدون پل. سریع‌ترین گزینه، اما فقط جایی کار می‌کند که Tor مسدود نباشد.
ru: Подключение к публичным узлам Tor без мостов. Самый быстрый вариант, но работает только там, где Tor не заблокирован.
uk: Підключення до публічних вузлів Tor без мостів. Найшвидше, але працює лише там, де Tor не заблоковано.
zh_hans: 不使用网桥，直接连接公共 Tor 中继。速度最快，但仅在 Tor 未被封锁的地方可用。

source: Connect when Veil starts
fa: اتصال هنگام اجرای Veil
ru: Подключаться при запуске Veil
uk: Підключатися під час запуску Veil
zh_hans: Veil 启动时自动连接

source: Connect, or enable Turbo, to test
fa: برای آزمایش، متصل شوید یا Turbo را فعال کنید
ru: Подключитесь или включите Turbo для проверки
uk: Підключіться або увімкніть Turbo для перевірки
zh_hans: 连接或启用 Turbo 后可测试

source: Connected
fa: متصل
ru: Подключено
uk: Підключено
zh_hans: 已连接

source: Connected through Tor
fa: از طریق Tor متصل شد
ru: Подключено через Tor
uk: Підключено через Tor
zh_hans: 已通过 Tor 连接

source: Connected, but nothing has moved with %lld connections open.
fa: متصل است، اما با %lld اتصال باز هیچ داده‌ای جابه‌جا نشده است.
ru: Подключено, но при %lld открытых соединениях ничего не передаётся.
uk: Підключено, але за %lld відкритих з’єднань нічого не передається.
zh_hans: 已连接，但在 %lld 个连接打开的情况下没有任何数据流动。

source: Connected. %lld destination group(s) bypass Tor and see your real IP.
fa: متصل است. %lld گروه مقصد از Tor عبور نمی‌کنند و نشانی IP واقعی شما را می‌بینند.
ru: Подключено. Групп назначений в обход Tor: %lld — они видят ваш настоящий IP.
uk: Підключено. Груп призначень в обхід Tor: %lld — вони бачать вашу справжню IP-адресу.
zh_hans: 已连接。%lld 组目标绕过 Tor，能看到你的真实 IP。

source: Connecting
fa: در حال اتصال
ru: Подключение
uk: Підключення
zh_hans: 正在连接

source: Connecting to Tor directly on a network that blocks it
fa: اتصال مستقیم به Tor در شبکه‌ای که آن را مسدود می‌کند
ru: Прямое подключение к Tor в сети, которая его блокирует
uk: Пряме підключення до Tor у мережі, яка його блокує
zh_hans: 在封锁 Tor 的网络上直连 Tor

source: Connecting to the Tor network
fa: در حال اتصال به شبکهٔ Tor
ru: Подключение к сети Tor
uk: Підключення до мережі Tor
zh_hans: 正在连接 Tor 网络

source: Connecting to the loop (attempt %lld)…
fa: در حال اتصال به حلقه (تلاش %lld)…
ru: Подключение к циклу (попытка %lld)…
uk: Підключення до циклу (спроба %lld)…
zh_hans: 正在连接回环（第 %lld 次尝试）…

source: Connecting to the loop through Tor (attempt %lld)…
fa: در حال اتصال به حلقه از طریق Tor (تلاش %lld)…
ru: Подключение к циклу через Tor (попытка %lld)…
uk: Підключення до циклу через Tor (спроба %lld)…
zh_hans: 正在通过 Tor 连接回环（第 %lld 次尝试）…

source: Connecting — %lld per cent bootstrapped. Nothing is tunnelled yet.
fa: در حال اتصال — %lld درصد راه‌اندازی شده. هنوز چیزی تونل نمی‌شود.
ru: Подключение — загружено %lld процентов. Пока ничего не туннелируется.
uk: Підключення — завантажено %lld відсотків. Поки нічого не тунелюється.
zh_hans: 正在连接 — 已引导 %lld%。尚未有流量走隧道。

source: Connection
fa: اتصال
ru: Подключение
uk: Підключення
zh_hans: 连接

source: Connection Failed
fa: اتصال ناموفق بود
ru: Ошибка подключения
uk: Помилка підключення
zh_hans: 连接失败

source: Connections through Veil are failing — %@.
fa: اتصال‌ها از طریق Veil شکست می‌خورند — %@.
ru: Соединения через Veil не проходят — %@.
uk: З’єднання через Veil не проходять — %@.
zh_hans: 通过 Veil 的连接正在失败 — %@。

source: Connections: %lld via Tor, %lld direct, %lld with anti-throttling, %lld blocked
fa: اتصال‌ها: %lld از طریق Tor، %lld مستقیم، %lld با ضد کندسازی، %lld مسدود
ru: Соединения: %lld через Tor, %lld напрямую, %lld с обходом замедления, %lld заблокировано
uk: З’єднання: %lld через Tor, %lld напряму, %lld з обходом сповільнення, %lld заблоковано
zh_hans: 连接：%lld 个经 Tor，%lld 个直连，%lld 个使用反限速，%lld 个被阻断

source: Continue
fa: ادامه
ru: Далее
uk: Далі
zh_hans: 继续

source: Controls
fa: کنترل‌ها
ru: Настройки защиты
uk: Налаштування захисту
zh_hans: 控制项

source: Copied
fa: کپی شد
ru: Скопировано
uk: Скопійовано
zh_hans: 已拷贝

source: Copy
fa: کپی
ru: Копировать
uk: Копіювати
zh_hans: 拷贝

source: Copy to clipboard
fa: کپی در کلیپ‌بورد
ru: Скопировать в буфер
uk: Скопіювати в буфер
zh_hans: 拷贝到剪贴板

source: Could not connect
fa: اتصال برقرار نشد
ru: Не удалось подключиться
uk: Не вдалося підключитися
zh_hans: 无法连接

source: Could not open %@
fa: باز کردن %@ ممکن نشد
ru: Не удалось открыть %@
uk: Не вдалося відкрити %@
zh_hans: 无法打开 %@

source: Could not reach Veil’s private onion service through Tor.
fa: دسترسی به سرویس onion خصوصی Veil از طریق Tor ممکن نشد.
ru: Не удалось достучаться до приватного onion-сервиса Veil через Tor.
uk: Не вдалося дістатися приватного onion-сервісу Veil через Tor.
zh_hans: 无法通过 Tor 访问 Veil 的私有洋葱服务。

source: Could not reach the bridge service: %@
fa: دسترسی به سرویس پل ممکن نشد: %@
ru: Не удалось связаться со службой мостов: %@
uk: Не вдалося зв’язатися зі службою мостів: %@
zh_hans: 无法访问网桥服务：%@

source: Could not read Tor’s control authentication cookie.
fa: کوکی احراز هویت کنترل Tor خوانده نشد.
ru: Не удалось прочитать cookie авторизации Tor.
uk: Не вдалося прочитати cookie авторизації Tor.
zh_hans: 无法读取 Tor 的控制端口认证 cookie。

source: Could not save network settings: %@
fa: تنظیمات شبکه ذخیره نشد: %@
ru: Не удалось сохранить сетевые настройки: %@
uk: Не вдалося зберегти мережеві налаштування: %@
zh_hans: 无法保存网络设置：%@

source: Cover traffic
fa: ترافیک پوششی
ru: Покрывающий трафик
uk: Покривальний трафік
zh_hans: 掩护流量

source: Covers Telegram Web only. The Telegram app ignores the system proxy: add Veil as its SOCKS5 proxy with the button below and it connects through Tor.
fa: فقط Telegram Web را پوشش می‌دهد. برنامهٔ Telegram پراکسی سیستم را نادیده می‌گیرد: با دکمهٔ زیر Veil را به عنوان پراکسی SOCKS5 آن اضافه کنید تا از طریق Tor متصل شود.
ru: Действует только для Telegram Web. Приложение Telegram игнорирует системный прокси: добавьте Veil как его SOCKS5-прокси кнопкой ниже, и оно подключится через Tor.
uk: Діє лише для Telegram Web. Застосунок Telegram ігнорує системний проксі: додайте Veil як його SOCKS5-проксі кнопкою нижче, і він підключиться через Tor.
zh_hans: 仅覆盖 Telegram 网页版。Telegram 应用会忽略系统代理：用下方按钮把 Veil 添加为其 SOCKS5 代理，它就会通过 Tor 连接。

source: Covers youtube.com, googlevideo.com, ytimg.com, ggpht.com and the other YouTube hosts. QUIC/HTTP3 is never used through the proxy, so the anti-throttling trick always applies.
fa: شامل youtube.com، googlevideo.com، ytimg.com، ggpht.com و سایر میزبان‌های YouTube. از طریق پراکسی هرگز QUIC/HTTP3 استفاده نمی‌شود، بنابراین ترفند ضد کندسازی همیشه اعمال می‌شود.
ru: Действует для youtube.com, googlevideo.com, ytimg.com, ggpht.com и остальных хостов YouTube. Через прокси QUIC/HTTP3 не используется, поэтому обход замедления применяется всегда.
uk: Діє для youtube.com, googlevideo.com, ytimg.com, ggpht.com та інших хостів YouTube. Через проксі QUIC/HTTP3 не використовується, тому обхід сповільнення застосовується завжди.
zh_hans: 覆盖 youtube.com、googlevideo.com、ytimg.com、ggpht.com 及其他 YouTube 主机。通过代理时不会使用 QUIC/HTTP3，因此反限速技巧始终生效。

source: Creating a private onion service…
fa: در حال ساخت سرویس onion خصوصی…
ru: Создание приватного onion-сервиса…
uk: Створення приватного onion-сервісу…
zh_hans: 正在创建私有洋葱服务…

source: Creating the onion loop…
fa: در حال ساخت حلقهٔ onion…
ru: Создание onion-цикла…
uk: Створення onion-циклу…
zh_hans: 正在创建 onion 回环…

source: Custom bridges
fa: پل‌های سفارشی
ru: Свои мосты
uk: Власні мости
zh_hans: 自定义网桥

source: Cut open connections too
fa: قطع اتصال‌های باز نیز
ru: Разрывать и уже открытые соединения
uk: Розривати й уже відкриті з’єднання
zh_hans: 同时切断已打开的连接

source: Defence against traffic analysis
fa: دفاع در برابر تحلیل ترافیک
ru: Защита от анализа трафика
uk: Захист від аналізу трафіку
zh_hans: 流量分析防御

source: Demo mode
fa: حالت نمایشی
ru: Демо-режим
uk: Демо-режим
zh_hans: 演示模式

source: Demo mode: nothing is actually routed.
fa: حالت نمایشی: در واقع هیچ ترافیکی مسیریابی نمی‌شود.
ru: Демонстрационный режим: трафик на самом деле никуда не направляется.
uk: Демонстраційний режим: трафік насправді нікуди не спрямовується.
zh_hans: 演示模式：实际上没有任何流量被路由。

source: Diagnostics
fa: عیب‌یابی
ru: Диагностика
uk: Діагностика
zh_hans: 诊断

source: Diagnostics are exported unredacted
fa: گزارش عیب‌یابی بدون پنهان‌سازی صادر می‌شود
ru: Диагностика выгружается без обезличивания
uk: Діагностика вивантажується без знеособлення
zh_hans: 诊断信息导出时未做脱敏

source: Diagnostics are on the clipboard
fa: گزارش عیب‌یابی در کلیپ‌بورد است
ru: Диагностика лежит в буфере обмена
uk: Діагностика лежить у буфері обміну
zh_hans: 诊断信息在剪贴板中

source: Direct
fa: مستقیم
ru: Напрямую
uk: Напряму
zh_hans: 直连

source: Direct (no bridges)
fa: مستقیم (بدون پل)
ru: Напрямую (без мостов)
uk: Напряму (без мостів)
zh_hans: 直连（无网桥）

source: Direct modes are fast, but the site sees your real IP address. Everything else still goes through Tor.
fa: حالت‌های مستقیم سریع‌اند، اما سایت آدرس IP واقعی شما را می‌بیند. بقیهٔ ترافیک همچنان از Tor عبور می‌کند.
ru: Прямые режимы быстрые, но сайт видит ваш реальный IP-адрес. Всё остальное по-прежнему идёт через Tor.
uk: Прямі режими швидкі, але сайт бачить вашу справжню IP-адресу. Усе інше й далі йде через Tor.
zh_hans: 直连模式速度快，但站点会看到你的真实 IP 地址。其他一切仍通过 Tor。

source: Direct, anti-throttling
fa: مستقیم، با ضد کندسازی
ru: Напрямую, с обходом замедления
uk: Напряму, з обходом сповільнення
zh_hans: 直连，反限速

source: Direct, so updates keep working
fa: مستقیم، تا به‌روزرسانی‌ها کار کنند
ru: Напрямую, чтобы обновления работали
uk: Напряму, щоб оновлення працювали
zh_hans: 直连，以保证更新正常

source: Directory authorities did not answer, so this network appears to block Tor. A bridge would be harder to spot.
fa: مراجع دایرکتوری پاسخ ندادند، پس به نظر می‌رسد این شبکه Tor را مسدود می‌کند. یک پل سخت‌تر دیده می‌شود.
ru: Директории Tor не ответили — похоже, эта сеть блокирует Tor. Мост заметить труднее.
uk: Каталоги Tor не відповіли — схоже, ця мережа блокує Tor. Міст помітити важче.
zh_hans: 目录权威没有响应，看起来这个网络封锁了 Tor。使用网桥更难被发现。

source: Disconnect
fa: قطع اتصال
ru: Отключить
uk: Відключити
zh_hans: 断开

source: Disconnect from Tor (⇧⌘K)
fa: قطع اتصال از Tor (⇧⌘K)
ru: Отключиться от Tor (⇧⌘K)
uk: Відключитися від Tor (⇧⌘K)
zh_hans: 断开 Tor 连接 (⇧⌘K)

source: Disconnecting
fa: در حال قطع اتصال
ru: Отключение
uk: Відключення
zh_hans: 正在断开

source: Dismiss
fa: بستن
ru: Скрыть
uk: Сховати
zh_hans: 关闭

source: Done
fa: انجام شد
ru: Готово
uk: Готово
zh_hans: 完成

source: Download
fa: دانلود
ru: Скачать
uk: Завантажити
zh_hans: 下载

source: Download Veil %@
fa: دانلود Veil %@
ru: Скачать Veil %@
uk: Завантажити Veil %@
zh_hans: 下载 Veil %@

source: Download the new DMG, replace Veil in Applications and relaunch.
fa: DMG جدید را دانلود کنید، Veil را در پوشهٔ Applications جایگزین کنید و دوباره اجرا کنید.
ru: Скачайте новый DMG, замените Veil в «Программах» и перезапустите.
uk: Завантажте новий DMG, замініть Veil у «Програмах» і перезапустіть.
zh_hans: 下载新的 DMG，替换“应用程序”中的 Veil 并重新启动。

source: Downloads and open pages stay on the old route until they finish; only new connections take the new one. Switch off to drop everything at once, as “New Identity” does.
fa: دانلودها و صفحات باز تا پایان روی مسیر قدیمی می‌مانند؛ فقط اتصال‌های جدید مسیر تازه را می‌گیرند. برای قطع همه‌چیز یکجا، مانند «هویت جدید»، خاموش کنید.
ru: Загрузки и открытые страницы остаются на старом маршруте, пока не завершатся; по новому идут только новые соединения. Выключите, чтобы сбрасывать всё сразу, как делает «Новая личность».
uk: Завантаження та відкриті сторінки залишаються на старому маршруті, доки не завершаться; новим маршрутом ідуть лише нові з’єднання. Вимкніть, щоб скидати все одразу, як робить «Нова особа».
zh_hans: 下载和已打开的页面会留在旧路由上直到完成；只有新连接走新路由。关闭后将像“新身份”一样立即断开全部连接。

source: Dummy traffic is bounced through the Tor network to a private onion service on this Mac, so no website ever receives it. Tor’s own circuit and connection padding are forced on as well. Padding costs bandwidth — yours, the Snowflake volunteer’s and the Tor relays’ — so use the lightest level that fits.
fa: ترافیک ساختگی از طریق شبکهٔ Tor به یک سرویس onion خصوصی روی همین Mac برمی‌گردد، بنابراین هیچ وب‌سایتی آن را دریافت نمی‌کند. پوشش مدار و اتصال خود Tor هم اجباری فعال می‌شود. پوشش ترافیک پهنای باند مصرف می‌کند — از شما، داوطلب Snowflake و رله‌های Tor — پس سبک‌ترین سطح مناسب را انتخاب کنید.
ru: Пустой трафик проходит через сеть Tor до приватного onion-сервиса на этом Mac, так что ни один сайт его не получает. Также принудительно включаются встроенные circuit padding и connection padding самого Tor. Маскировка расходует трафик — ваш, волонтёра Snowflake и узлов Tor, — поэтому выбирайте самый лёгкий подходящий уровень.
uk: Порожній трафік проходить через мережу Tor до приватного onion-сервісу на цьому Mac, тож жоден сайт його не отримує. Також примусово вмикаються вбудовані circuit padding і connection padding самого Tor. Маскування витрачає трафік — ваш, волонтера Snowflake і вузлів Tor, — тому обирайте найлегший придатний рівень.
zh_hans: 伪流量经 Tor 网络回环到这台 Mac 上的私有洋葱服务，因此没有任何网站会收到它。Tor 自身的链路填充和连接填充也会被强制开启。填充会消耗带宽——你的、Snowflake 志愿者的以及 Tor 中继的——请选择够用的最轻档位。

source: Duration
fa: مدت
ru: Длительность
uk: Тривалість
zh_hans: 时长

source: Enable
fa: فعال کردن
ru: Включить
uk: Увімкнути
zh_hans: 启用

source: Entry guard (8K mode): %@ %@ · %@ MB/s consensus weight
fa: نگهبان ورودی (حالت 8K): %@ %@ · وزن اجماع %@ مگابایت/ثانیه
ru: Сторожевой узел (режим 8K): %@ %@ · вес консенсуса %@ МБ/с
uk: Сторожовий вузол (режим 8K): %@ %@ · вага консенсусу %@ МБ/с
zh_hans: 入口守卫（8K 模式）：%@ %@ · 共识权重 %@ MB/s

source: Establishing a circuit
fa: در حال برقراری مدار
ru: Установка цепочки
uk: Встановлення ланцюжка
zh_hans: 正在建立链路
